a = 2 # переменной присваиваем значение 2
a += 3 # увеличиваем значение переменной
a - имя переменной
= - оператор присваивания
2 - значение
2 = a #ошибка, имя переменной должно быть слева от оператора присваивания
b = 3
print(a + b)
a = 6 #присваиваем новое значение
print(a + b)
b = b + 2
print(b)
print(c) #ошибка: любая переменная должна быть проинициализирована перед использованием

input() # читает строку с клавиатуры
input('Введите данные')

s = input() # записать в переменную s пользовательский ввод

a = int(input()) #прочитать строку с клавиатуры и преобразовать в число